In [1]:
import pandas as pd
#import numpy as np
#import matplotlib.pyplot as plt
#import seaborn as sns
#from sklearn.preprocessing import StandardScaler
#from sklearn.model_selection import train_test_split

### loading the data

In [2]:
book_tags=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\book_tags.csv')
books=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\books.csv')
ratings=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\ratings.csv')
toread=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\toread.csv')

### checking out the data

In [3]:
book_tags

        goodreads_book_id  tag_id  count
0                       2   30574  24549
1                       2    8717   3516
2                       2   11305   3441
3                       2   11557   3423
4                       2    6857   1591
...                   ...     ...    ...
156795           31176886     860     10
156796           31176886   21825     10
156797           31176886   10866      9
156798           31176886   29045      9
156799           31176886   30581      9

[156800 rows x 3 columns]

In [4]:
book_mod=book_tags[['tag_id','count']]

In [5]:
group = book_tags.groupby([
    'goodreads_book_id','tag_id'
]).agg({
    'count': 'sum'
})

group.sort_values(by='count',ascending=False,inplace=True)

In [6]:
book_mod

        tag_id  count
0        30574  24549
1         8717   3516
2        11305   3441
3        11557   3423
4         6857   1591
...        ...    ...
156795     860     10
156796   21825     10
156797   10866      9
156798   29045      9
156799   30581      9

[156800 rows x 2 columns]

In [7]:
mod_grp=book_mod.groupby('tag_id')[['count']].sum()  #grouping the tags
mod_grp.sort_values(by='count',ascending=False,inplace=True)  #sorting the tags based on count

In [8]:
group.max()  #maximum number of tags for a book

count    380255
dtype: int64

In [9]:
group.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 156800 entries, (6186357, 30574) to (6167746, 21646)
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   count   156800 non-null  int64
dtypes: int64(1)
memory usage: 1.9 MB

In [10]:
group.describe()

               count
count  156800.000000
mean      166.787883
std      2769.954791
min         1.000000
25%         6.000000
50%        12.000000
75%        35.000000
max    380255.000000

In [11]:
ratings

        user_id  book_id  rating
0             4       21       5
1             8     9114       5
2             4      145       2
3             4     1057       3
4             4      596       3
...         ...      ...     ...
852083    49802     7112       3
852084    49802     7583       3
852085    49802     6864       3
852086    49802     8050       3
852087    49802     9128       3

[852088 rows x 3 columns]

In [12]:
books.isna().sum()  #checking for missing values

book_id                        0
goodreads_book_id              0
best_book_id                   0
work_id                        0
books_count                    0
isbn                          83
isbn13                        69
authors                        0
original_publication_year      6
original_title                76
title                          0
language_code                175
average_rating                 0
ratings_count                  0
work_ratings_count             0
work_text_reviews_count        0
ratings_1                      0
ratings_2                      0
ratings_3                      0
ratings_4                      0
ratings_5                      0
image_url                      0
small_image_url                0
dtype: int64

In [13]:
books=books[['book_id','work_id','goodreads_book_id','authors','title','books_count','average_rating','ratings_count','work_ratings_count','work_text_reviews_count','ratings_1','ratings_2','ratings_3','ratings_4','ratings_5']]

In [14]:
toread

        user_id  book_id
0            15      275
1           162      199
2           162     5220
3           162      345
4           301     2047
...         ...      ...
101840    34615     1387
101841    17635     7938
101842    36869     7844
101843     5237     2378
101844    48192     7773

[101845 rows x 2 columns]

# Q5: Which (tag_id) is the most frequently used ie. mapped with the highest number of books [book_tags.csv] ? (In case of more than one tag, mention the tag id with the least numerical value) (N)

In [15]:
mod_grp  #maximum number of books for a tag

           count
tag_id
30574   16703129
8717      942720
11557     646056
33114     538700
11305     489205
...          ...
31370          1
21632          1
21634          1
21640          1
25206          1

[9938 rows x 1 columns]

# Q3: How many unique users are present in the dataset [ratings.csv] ? (N)

directly opened the dataset in data wrangler

# Q8: Which is the least used tag, i.e. mapped with the lowest number of books [book_tags.csv]? (In case of more than one tag, mention the tag id with the least numerical value) (N)

In [16]:
mod_grp[mod_grp['count']==mod_grp['count'].min()].index.min()  #minimum tag id with only one book

49

# Q11: How many unique tags are there in the dataset [book_tags.csv] ? (N)

the data is already opened in data wrangler, so just read off the values from there

# Q4: Which book (title) has the maximum number of ratings based on (work_ratings_count) [books.csv] ? (S)

In [17]:
book_group = books.groupby(['title'])[['work_ratings_count']].sum()  #grouping the books based on ratings count
book_group.sort_values(by='work_ratings_count',ascending=False,inplace=True)

In [18]:
book_group

                                                    work_ratings_count
title
Twilight (Twilight, #1)                                        3916824
Harry Potter and the Order of the Phoenix (Harr...             1840548
Gone Girl                                                      1626519
City of Bones (The Mortal Instruments, #1)                     1241799
New Moon (Twilight, #2)                                        1199000
...                                                                ...
Animal-Speak: The Spiritual & Magical Powers of...                8750
If I Stay Collection (If I Stay, #1-2)                            8428
شاب كشك في رحلة البحث عن الجادون                                  8128
Si-cology 1: Tales and Wisdom from Duck Dynasty...                8058
The Chronicles of Narnia - The Lion, the Witch,...                7353

[1567 rows x 1 columns]

# Q7: Which book (goodreads_book_id) is marked as to-read by most users [books.csv,toread.csv] ? (N)

In [19]:
toread_group=toread.groupby('book_id').count()  #grouping the books based on user_id
toread_group.sort_values(by='user_id',ascending=False,inplace=True)

In [20]:
id=toread_group.iloc[0].name  #book id with maximum number of users

In [21]:
books[books['book_id']==id]  #checking the book with book_id=1

,book_id,work_id,goodreads_book_id,authors,title,books_count,average_rating,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5
3,46,3441236,43641,Sara Gruen,Water for Elephants,128,4.07,1068146,1108839,55732,16705,49832,200154,417328,424820

# Q6: Which book (title) has the most number of counts of tags given by the user ie. the book with maximum user records including all tags [book_tags.csv,books.csv] ? (S)

In [22]:
book_id=group.iloc[0].name[0]  #book id with maximum number of tags
book=books[books['goodreads_book_id']==book_id]  #checking the book with maximum number of tags

In [23]:
book

,book_id,work_id,goodreads_book_id,authors,title,books_count,average_rating,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5
13,91,6366642,6186357,James Dashner,"The Maze Runner (Maze Runner, #1)",147,4.02,719925,777956,48942,15291,43370,150488,266698,302109

# Q2: How many unique books are present in the dataset ? Evaluate based on the 'book_id'? [books.csv] (N)

open the dataset in data wrangler and read off the answer

# Q10: Which book (goodreads_book_id) has the least number of count of tags given by the user ie. the book with minimum user records including all tags [book_tags.csv] ? (N)

In [24]:
group[group['count']==group['count'].min()].index.min()  #tag id with maximum number of books

(3061, 49)

# Q14: Predict sentiment using Textblob. How many positive titles (original_title) are there [books.csv] ? (cut-off >=0) N

In [26]:
!pip install textblob

Defaulting to user installation because normal site-packages is not writeable
Collecting textblob
  Using cached textblob-0.18.0.post0-py3-none-any.whl.metadata (4.5 kB)
Requirement already satisfied: nltk>=3.8 in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from textblob) (3.9.1)
Requirement already satisfied: click in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from nltk>=3.8->textblob) (8.1.7)
Requirement already satisfied: joblib in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from nltk>=3.8->textblob) (1.3.2)
Requirement already satisfied: regex>=2021.8.3 in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from nltk>=3.8->textblob) (2024.7.24)
Requirement already satisfied: tqdm in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from nltk>=3.8->textblob) (4.66.2)
Requirement already satisfied: colorama in c:\users\vvagh\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from click->nltk>=3.8->textblob) (0.4.6)
Using cached textblob-0.18.0.post0-py3-none-any.whl (626 kB)
Installing collected packages: textblob
Successfully installed textblob-0.18.0.post0

In [27]:
#import nltk
#nltk.download('wordnet')
from textblob import TextBlob as tb
blob=tb(book['title'].values[0])
print(blob.sentiment)

Sentiment(polarity=0.0, subjectivity=0.0)

In [28]:
count=0
for i in books['title']:
    blob=tb(i)
    if blob.sentiment.polarity>=0:
        count+=1

In [29]:
count

1413